{
    "header": {
      "title": "My Portfolio",
      "description": "Welcome to my profile"
    },
    "home": {
      "welcome": "Hello, my name is Aléxis Toigo and I am a software developer.",
      "bio": "I have experience in several languages ​​and frameworks, such as Java, Python, C++, Spring Boot, React and others. Oracle, PostgreSQL and MariaDB databases. I am currently working as a software developer at Cyberlog Automação e Logística."
    },
    "experienceSection": {
    "title": "Professional Experiences",
    "experiences": [
      {
        "company": "Compass.uol",
        "role": "Backend Developer",
        "duration": "2020 - 2022",
        "projects": ["Open eCommerce", "Lojas Renner"],
        "activities": [
          "Open Source E-commerce Project: I collaborated in the development of an e-commerce solution using the Magento platform. I was responsible for creating a catalog and microservices integration routine, using Java Spring Boot and RabbitMQ to optimize the maintenance and updating of the product catalog.",
          "Renner Stores Project: I worked on one of the company's largest projects, integrating the Checkout, After-Sales, Service and Logistics squad, using the Oracle ATG platform. I contributed to the creation of new features and ongoing maintenance."
        ]
      },
      {
        "company": "Compass.uol",
        "role": "Data Engineer",
        "duration": "2022 - 2022",
        "projects": ["Ailos", "Sicredi", "Melitta"],
        "activities": [
          "Assisted in building and enhancing data pipelines across multiple environments, including DataLake, Data Warehouse, and LakeHouse systems. Including a migration to a new Data Warehouse."
        ]
      },
      {
        "company": "Cyberlog",
        "role": "Backend Developer",
        "duration": "2022 - current",
        "projects": ["Cyberlog WMS"],
        "activities": [
          "Development and maintenance of a Warehouse Management System (WMS). Creation of back-end solutions using the stack (Java EE, JSF, Primefaces), as well as integration with PostgreSQL and Oracle databases, along with the implementation of PL-SQL.",
          "Development for Android, using Java."
        ]
      }
    ]
  },
  "educationSection": {
    "title": "Academic Background",
    "education": [
      {
        "type": "Barachelors Degree",
        "course": "Computer Science - University Regional Integrada do Alto Uruguai e das Missões - URI",
        "activities": [
          "SBC/ICPC Programming Marathon Team"
        ]
      },
      {
        "type": "Master Student",
        "course": "Applied Computing - University of Passo Fundo - UPF",
        "activities": [
          "Project that improves the application of the Genetic Algorithm to solve the CBCTT (Curriculum-Based Course Timetabling) problem.",
          "Adding a new functionality to the algorithm, allowing for the optimized allocation of classrooms, laboratories and physical spaces at the university. The main objective of the project is to optimize the use of spaces on campus, reducing the number of buildings needed and minimizing student travel."        ]
      }
    ]
  },
  "linksSection": {
    "title": "My Links",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "email": "E-mail"
  },
  "footer": {
    "rights": "All rights reserved."
  }
}