{
    "header": {
      "title": "Meu Portfólio",
      "description": "Bem-vindo ao meu perfil"
    },
    "home": {
      "welcome": "Olá, meu nome é Aléxis Toigo e sou um desenvolvedor de software.",
      "bio": "Tenho experiência em várias linguagens e frameworks, como Java, Python, C++, Spring Boot, React e entre outros. Banco de dados Oracle, PostgreSQL e MariaDB. Atualmente, estou trabalhando como desenvolvedor de software na empresa Cyberlog Automação e Logística."
    },
    "experienceSection": {
    "title": "Experiências Profissionais",
    "experiences": [
      {
        "company": "Cyberlog Automação e Logística",
        "role": "Desenvolvedor Backend",
        "duration": "2022 - atual",
        "projects": ["Cyberlog WMS"],
        "activities": [
          "Desenvolvimento e manutenção de um sistema de Gerenciamento de Armazém (WMS). Criação de soluções de back-end utilizando a stack (Java EE, JSF, Primefaces), bem como a integração com os bancos de dados PostgreSQL e Oracle, juntamente com a implementação de PL-SQL.",
          "Desenvolvimento para Android, utilizando Java."
        ]
      },
      {
        "company": "Compass.uol",
        "role": "Engenheiro de Dados",
        "duration": "2022 - 2022",
        "projects": ["Ailos", "Sicredi", "Melitta"],
        "activities": [
          "Auxiliei na construção e aprimoramento de pipelines de dados em diversos ambientes, incluindo sistemas de DataLake, Data Warehouse e LakeHouse. Incluindo uma migração para um novo Data Warehouse."
        ]
      },
      {
        "company": "Compass.uol",
        "role": "Desenvolvedor Backend",
        "duration": "2020 - 2022",
        "projects": ["Open eCommerce", "Lojas Renner"],
        "activities": [
          "Projeto de E-commerce Open Source: Colaborei no desenvolvimento de uma solução de e-commerce utilizando a plataforma Magento. Fui responsável pela criação de uma rotina de integração de catálogo e microsserviços, empregando Java Spring Boot e RabbitMQ para otimizar a manutenção e atualização do catálogo de produtos.",
          "Projeto Lojas Renner: Atuei em um dos maiores projetos da empresa, integrando a squad de Checkout, Pós-Vendas, Atendimento e Logística, utilizando a plataforma Oracle ATG. Contribuí para a criação de novas funcionalidades e na manutenção contínua."
        ]
      }
    ]
  },
  "educationSection": {
    "title": "Formação Acadêmica",
    "education": [
      {
        "type": "Mestrado",
        "course": "Mestrado em Computação Aplicada - Universidade de Passo Fundo - UPF",
        "activities": [
          "Projeto que aprimora a aplicação do Algoritmo Genético para resolver o problema CBCTT (Curriculum-Based Course Timetabling).",
          "Agregar uma nova funcionalidade ao algoritmo, permitindo a alocação otimizada de salas, laboratórios e espaços físicos da universidade. O objetivo principal do projeto é otimizar a utilização de espaços no campus, reduzindo o número de prédios necessários e minimizando o deslocamento dos estudantes."
        ]
      },
      {
        "type": "Bacharelado",
        "course": "Bacharelado em Ciência da Computação - Universidade Regional Integrada do Alto Uruguai e das Missões - URI",
        "activities": [
          "Equipe Maratona de Programação SBC"
        ]
      }
    ]
  },
  "linksSection": {
    "title": "Meus Links",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "email": "E-mail"
  },
  "footer": {
    "rights": "Todos os direitos reservados."
  }
}
  